WIDTH = 40
HEIGHT = 25
SCALE = 30
RADIUS = 5
ELEMENT_SIZE = 28
FPS = 120
INITIAL_SPEED_DELAY = FPS // 6
SNAKE_COLOR = "yellow"
SCORE_COLOR = "white"
SCREEN_COLOR = "black"
GAME_OVER_COLOR = "red"
NORMAL_FOOD_COLOR = "red"
SPEED_FOOD_COLOR = "cyan"
SHRINK_FOOD_COLOR = "white"
LEVEL_1_TARGET = 20
LEVEL_2_TARGET = 25
LEVEL_3_TARGET = 25

OBSTACLES_LEVEL_2 = [
    # Верхняя горизонталь
    (6, 4), (7, 4), (8, 4), (9, 4), (10, 4), (11, 4),
    # Центральная вертикаль
    (18, 5), (18, 6), (18, 7), (18, 8), (18, 9), (18, 10), (18, 11),
    # Левая стенка
    (10, 8), (11, 8), (12, 8), (13, 8), (14, 8), (15, 8),
    # Правая стенка
    (25, 15), (26, 15), (27, 15), (28, 15), (29, 15),
    # Нижний блок
    (30, 20), (31, 20), (32, 20), (33, 20), (34, 20), (35, 20), (36, 20),
    # Доп. препятствия
    (5, 16), (6, 16), (7, 16),
    (22, 7), (23, 7), (24, 7),
]

OBSTACLES_LEVEL_3 = [
    # Внешние сегменты-рамки
    (3, 3), (4, 3), (5, 3), (6, 3), (7, 3), (8, 3),
    (31, 3), (32, 3), (33, 3), (34, 3), (35, 3), (36, 3),

    (3, 21), (4, 21), (5, 21), (6, 21), (7, 21), (8, 21),
    (31, 21), (32, 21), (33, 21), (34, 21), (35, 21), (36, 21),

    # Вертикали слева/справа
    (6, 7), (6, 8), (6, 9), (6, 10), (6, 11),
    (33, 7), (33, 8), (33, 9), (33, 10), (33, 11),

    # Большой центральный крест
    (18, 6), (18, 7), (18, 8), (18, 9), (18, 10), (18, 11), (18, 12), (18, 13), (18, 14), (18, 15), (18, 16), (18, 17),
    (12, 12), (13, 12), (14, 12), (15, 12), (16, 12), (17, 12),
    (19, 12), (20, 12), (21, 12), (22, 12), (23, 12), (24, 12),

    # Доп. внутренние блоки
    (10, 8), (11, 8), (12, 8), (13, 8),
    (23, 8), (24, 8), (25, 8), (26, 8),

    (10, 16), (11, 16), (12, 16), (13, 16),
    (23, 16), (24, 16), (25, 16), (26, 16),

    # Нижние коридорные сегменты
    (14, 19), (15, 19), (16, 19), (17, 19),
    (19, 19), (20, 19), (21, 19), (22, 19),
]
